package site.linyy.relax.common;

import java.util.Calendar;

import org.apache.commons.lang.math.RandomUtils;

public class BeautyUtil {

    private static String[] BEAUTIES = { "你是最好的", "你是最棒的", "努力生活", "三军可夺帅也",
            "匹夫不可夺志也", "诚信为人之本", "微笑价值连城", "不戚戚于贫贱", "不汲汲于富贵", "平易近人", "废寝忘食",
            "鞠躬尽瘁", "料事如神", "博古通今", "集思广益", "憨态可掬", "斗志昂扬", "悠然自得", "能说会道",
            "出口成章", "眼高手低", "口是心非", "眉清目秀", "走马观花", "促膝谈心", "心旷神怡", "眉开眼笑",
            "垂头丧气", "一身正气", "力挽狂澜", "宽宏大度", "大义凛然", "死而后已", "足智多谋", "才华横溢",
            "举一反三", "文质彬彬", "意气风发", "眉飞色舞", "巧舌如簧", "语惊四座", "目瞪口呆", "手疾眼快",
            "袖手傍观", "欢呼雀跃", "前俯后仰", "心平气和", "愁眉苦脸", "嬉皮笑脸", "临危不惧", "急中生智",
            "冰清玉洁", "临危不俱", "融会贯通", "出类拔萃", "风度翩翩", "威风凛凛", "喜笑颜开", "能言善辩",
            "娓娓而谈", "胸无点墨", "手疾眼快", "口出不逊", "扶老携幼", "奔走相告", "目不转睛", "愁眉紧锁",
            "光明磊落", "仰不愧天", "持之以恒", "光明磊落", "学贯中西", "博大精深", "相貌堂堂", "容光焕发",
            "神采奕奕", "滔滔不绝", "妙语连珠", "头重脚轻", "耳闻目睹", "手舞足蹈", "跋山涉水", "呆若木鸡",
            "目瞪口呆", "堂堂正正", "镇定自若", "锲而不舍", "不屈不挠", "落落大方", "神采奕奕", "欣喜若狂",
            "伶牙俐齿", "口若悬河", "手足轻深", "头破血流", "大智大勇", "化险为夷", "曾经沧海难为水",
            "除却巫山不是云", "人生如逆旅", "我亦是行人", "两情若是久长时", "又岂在朝朝暮暮", "人生自是有情痴",
            "此恨不关风与月", "身无彩凤双飞翼", "心有灵犀一点通", "菩提本无树", "明镜亦非台", "抽刀断水水更流",
            "举杯消愁愁更愁", "近水楼台先得月", "向阳花木易为春", "今人不见古时月", "今月曾经照古人", "同是天涯沦落人",
            "相逢何必曾相识", "采得百花成蜜后", "为谁辛苦为谁甜", "春蚕到死丝方尽", "蜡炬成灰泪始干", "想人生最苦离别",
            "落红不是无情物", "化作春泥更护花", "酒逢知己千杯少", "话不投机半句多", "射人先射马", "擒贼先擒王",
            "时人不识凌云木", "直待凌云始道高", "竹外桃花三两枝", "春江水暖鸭先知", "夕阳无限好", "只是近黄昏",
            "长风破浪会有时", "直挂云帆济沧海", "梅须逊雪三分白", "雪却输梅一段香", "世人结交须黄金", "黄金不多交不深",
            "纸上得来终觉浅", "绝知此事要躬行", "沉舟侧畔千帆过", "病树前头万木春", "山重水复疑无路", "柳暗花明又一村",
            "会当凌绝顶", "一览众山小", "海内存知己", "天涯若比邻", "等闲识得东风面", "万紫千红总是春", "人生亦有命",
            "安能行叹复坐愁", "世事短如春梦", "人情薄似秋云", "宣父犹能畏后生", "丈夫未可轻年少", "蝉噪林逾静",
            "鸟鸣山更幽", "天生我材必有用", "千金散尽还复来", "不识庐山真面目", "只缘身在此山中", "博观而约取",
            "厚积而薄发", "莫笑贱贫夸富贵", "共成枯骨两何如", "古人学问无遗力", "少壮工夫老始成", "若言琴上有琴声",
            "放在匣中何不鸣", "松树千年终是朽", "槿花一日自为荣", "试玉要烧三日满", "辨材须待七年期", "草木有本心",
            "何求美人折", "世间行乐亦如此", "古来万事东流水", "人生得意须尽欢", "莫使金樽空对月", "衰兰送客咸阳道",
            "天若有情天亦老", "江山代有才人出", "各领风骚数百年", "少壮不努力", "老大徒伤悲", "家国兴亡自有时",
            "吴人何苦怨西施", "谁道人生无再少", "门前流水尚能西", "休将白发唱黄鸡", "不畏浮云遮望眼", "只缘身在最高层",
            "居高声自远", "非是藉秋风", "人间万事", "毫发常重泰山轻", "问渠哪得清如许", "为有源头活水来", "沧浪之水清兮",
            "可以濯我缨", "冰,水为之", "年年岁岁花相似", "岁岁年年人不同", "历览前贤国与家", "成由勤俭破由奢",
            "野火烧不尽", "春风吹又生", "不积小流", "无以成江海", "河海不择细流", "故能就其深", "欲穷千里目",
            "更上一层楼", "假金方用真金镀", "若是真金不镀金", "少年易学老难成", "一寸光阴不可轻", "古人今人若流水",
            "共看明月皆如此", "叶落当归根", "云沉久必起", "问君何能尔", "心远地自偏", "横看成岭侧成峰", "远近高低各不同",
            "疾风知劲草", "板荡识诚臣", "人生如寄", "何事辛苦怨斜晖", "朝真暮伪何人辨", "古往今来底事无", "积土成山",
            "风雨兴焉；积水成渊", "蛟龙生焉", "只在此山中", "云深不知处", "半亩方塘一鉴开", "天光云影共徘徊",
            "鸟飞反故乡兮", "狐死必首丘", "人恒过然后能改", "最是繁丝摇落后", "转教人忆春山", "不用思量今古",
            "俯仰昔人非", "杀人亦有限", "列国自有疆", "别有幽愁暗恨生", "此时无声胜有声", "人有悲欢离合", "月有阴晴圆缺",
            "此事古难全", "知我者", "谓我心忧；不知我者", "谓我何求", "望云惭高鸟", "临水愧游鱼", "日出入安穷",
            "时世不与人同", "今人嗤点流传赋", "不觉前贤畏后生", "草萤有耀终非火", "荷露虽团岂是珠", "春种一粒粟",
            "秋收万颗子", "不鸣则已", "一鸣惊人", "工欲善其事", "必先利其器", "朽木不可雕也", "粪土之墙不可圬也",
            "虑澹物自轻", "意惬理无违", "先天下之忧而忧", "后天下之乐而乐 ", "顺风而呼", "声非加疾也", "而闻者彰",
            "行人莫便消魂去", "汉渚星桥尚有期", "尔曹身与名俱灭", "不废江河万古流", "非淡泊无以明志", "非宁静无以致远",
            "靡不有初", "鲜克有终", "器乏雕梁器", "材非构厦材"

    };

    // private static String[] BEAUTIES = { "许多人浪费了整整一生去等待符合他们心愿的机会。",
    // "宁可去追求虚无，也不能无所追求。", "所谓高贵的灵魂，即对自己怀有敬畏之心。", "谦逊基于力量，傲慢基于无能。",
    // "但凡不能杀死你的，最终都会使你更强大。", "一个人知道自己为什么而活，就可以忍受任何一种生活。",
    // "骄傲的人给自己种下了悲伤和遗憾", "你是最好的", "你是最棒的", "努力生活", "成功的唯一秘诀——坚持到最后一分钟。",
    // "烈火试真金，逆境试强者。", "三军可夺帅也，匹夫不可夺志也。", "发光并非太阳的专利，你也可以发光。",
    // "每一个不曾起舞的日子，都是对生命的辜负。", "易于实现的目标就是最好的目标。", "友谊是人生的调味品，也是人生的止痛药。",
    // "诚信为人之本。", "明日复明日，明日何其多？我生待明日，万事成磋砣。", "每一发奋努力的背后，必有加倍的赏赐。",
    // "行动是治愈恐惧的良药，而犹豫、拖延将不断滋养恐惧。", "弱者用泪水安慰自己，强者用汗水磨练自己。",
    // "骏马是跑出来的，强兵是打出来的。", "山路曲折盘旋，但毕竟朝着顶峰延伸。", "你不勇敢，没人替你坚强！",
    // "真正的强者，不是流泪的人，而是含泪奔跑的人。", "生气是拿别人做错的事来惩罚自我。", "你务必百分之百的把自我推销给自我。",
    // "上帝从不埋怨人们的愚昧，人们却埋怨上帝的不公平。", "人只要不失去方向，就不会失去自我。", "失败只有一种，那就是半途而废。",
    // "游手好闲会使人心智生锈。", "第一个青春是上帝给的；第二个的青春是靠自我发奋的。", "人的价值，在遭受诱惑的一瞬间被决定。",
    // "如果你曾歌颂黎明，那么也请你拥抱黑夜。", "世界会向那些有目标和远见的人让路。", "微笑不用花一分钱，却永远价值连城。",
    // "无论你觉得自我多么的了不起，也永远有人比你更强。", "世上最累人的事，莫过于虚伪的过日子。",
    // "决不能放下，世界上没有失败，只有放下。", "生前的赞扬往往虚假，死后的议论常常真实。", "走自我的路，让他人去说。",
    // "生活中若没有兄弟姐妹，就像生活中没有阳光一样。", "“不可能”只存在于蠢人的字典里。", "明天的期望，让咱们忘了这天的痛苦。",
    // "不戚戚于贫贱，不汲汲于富贵。", "伪装的善良比真实的凶残更可怕。", "失败的是事，绝不应是人。" };

    // 每日一条相同的句子
    public static String getByDate() {

        int count = BEAUTIES.length;
        int date = Calendar.getInstance().get(Calendar.DAY_OF_YEAR);
        int result = date % count;
        return BEAUTIES[result];
    }

    // 每次随机一条句子
    public static String getByRandom() {

        int count = BEAUTIES.length;
        int index = RandomUtils.nextInt(count);
        return BEAUTIES[index];
    }

}
